{
  "toppage": "Top Page",
  "toppage_description": "Future - Creating the future with software development and IT solutions. Innovative technology for your business.",
  "introducepage": "Company Overview",
  "servicepage": "About Services",
  "newspage": "News/Blog List",
  "adoptpage": "Recruit",
  "contactpage": "Contact",
  "adoptpage_m": "Recruit",
  "contactpage_m": "Contact",
  "Recurit": "Recruit",
  "Contact": "Contact",
  "copyright": "Copyright (C) 2024 xFuture Inc. All Rights Reserved.",
  "address": "8F, ACN Nihonbashi Riverside Building, 3-23-1 Nihonbashi-Hamacho, Chuo-ku, Tokyo 103-0007, Japan",
  "Inquiry_by_phone": "Inquiry by phone",
  "business_hours": "Business hours",
  "inquiry_form": "Inquiry form is here",

  "service": {
    "home": "Home",
    "Support": "Supported Languages",
    "SES": "SES",
    "System": "System Engineering Service",
    "Through": "Through SES, we respond to diverse technical needs of clients by dispatching engineers with expertise and skills. This improves project efficiency, solves technical challenges, and optimizes resources. Our engineers stay updated with the latest technology trends and market dynamics, providing optimal solutions to support the business success of our clients.",
    "Development": "System Contracting and Outsourced Development",
    "We": "We offer end-to-end services, from design to development, testing, and implementation, delivering tailored solutions for project success. Our skilled engineers build innovative systems using the latest technology trends, supporting business growth. We also maintain close communication with clients, adapting to changing requirements and market trends to achieve optimal results.",
    "Supported_languages": "Supported Languages",
    "Case_study": "Case Study",
    "Case": "Case Study",
    "messages": [
      {
        "text": "Our team successfully developed a virtual coin exchange project, being fully involved in its development from the initial stage. The core of this project lies in the application of advanced blockchain technology to ensure the security and transparency of transactions. Our expert team excelled not only in technical implementation but also made significant contributions in project management and system optimization."
      },
      {
        "text": "We also participated in a financial derivatives business project, mainly responsible for modifying and optimizing the functions of existing systems. This process demonstrated our deep understanding of Japanese banking systems and our ability to efficiently handle complex financial technology issues."
      },
      {
        "text": "We specialize in providing blockchain technology interfaces for securities trading systems. Our mission is to develop efficient and secure blockchain interfaces that other teams can use when constructing the entire securities trading system. These interfaces are designed to enhance transparency, security, and efficiency throughout the system."
      }
    ]
  },

  "introduce": {
    "company_overview": "Company Overview",
    "home": "Home",
    "message": "Message",
    "trust_and_growth": "We value the trust relationship with our customers and aspire to be a partner for mutual growth.",
    "welcome_message": "Thank you very much for visiting the website of xFuture Co., Ltd.",
    "welcome_message2": "Our company mission is to continue pursuing innovation in technology and services. In order to meet the changing market and diverse customer needs, we provide solutions that incorporate the latest technologies and build systems that combine reliability and quality.",
    "welcome_message3": "Each of our employees continuously learns and stays sensitive to new technologies and market trends, striving to provide the highest value to our customers. In addition, we are building a professional and technically excellent team and nurturing industry-leading engineers and technical experts through ongoing training and career development programs.",
    "welcome_message4": "We value the trust relationship with our customers and aim to be a partner that grows together. Moving forward, xFuture Co., Ltd. will continue to pursue innovation and quality, contributing to the success of your business.",
    "welcome_message5": "We sincerely appreciate your continued support.",
    "ceo_name": "Reisaku Yamazaki",
    "company_profile": "Company Profile",
    "company_name": "Company Name",
    "company_name_value": "xFuture Inc.",
    "establishment_date": "Establishment Date",
    "establishment_date_value": "August 2021",
    "address": "Address",
    "address_value": "〒103-0007 3-23-1, Nihonbashi Hamacho, Chuo-ku, Tokyo, ACN Nihonbashi Riverside Building 8F",
    "address_value1": "〒103-0007 3-23-1, Nihonbashi Hamacho,",
    "address_value2": " Chuo-ku, Tokyo, ACN Nihonbashi Riverside Building 8F",
    "ceo": "CEO Name",
    "ceo_value": "Reisaku Yamazaki",
    "capital": "Capital",
    "capital_value": "55 million yen",
    "business_hours": "Business Hours",
    "business_hours_value": "9:00-18:00",
    "main_banks": "Main Banks",
    "main_banks_value": "Mizuho Bank Tokyo Chuo Branch",
    "main_banks_value2": "Musashino Bank Yoshikawa Branch",
    "holidays": "Holidays",
    "holidays_value": "Saturday, Sunday",
    "business_activities": "Business Activities",
    "business_activities_value1": "• System contracting and outsourced development (Finance, Cryptocurrency, Mobile App, etc.)",
    "business_activities_value2": "• Product sales and import/export",
    "access": "Access",
    "xfuture": "xFuture Inc.",
    "address_full": "〒103-0007 3-23-1, Nihonbashi Hamacho, Chuo-ku, Tokyo, ACN Nihonbashi Riverside Building 8F",
    "address_full_1": "〒103-0007 3-23-1",
    "address_full_2": "Nihonbashi Hamacho, Chuo-ku, Tokyo, ACN Nihonbashi Riverside Building 8F",
    "station_access1": "2min walk from Hamacho Station",
    "station_access2": "6min walk from Suitengumae Station",
    "station_access3": "8min walk from Ningyocho Station",
    "view_google_map": "View on Google Maps",
    "history": "History",
    "timeline": [
      {
        "year": "2021",
        "month": "August",
        "event": "xFuture Inc. was established."
      },
      {
        "year": "",
        "month": "October",
        "event": "Started accepting contracts for bank system development."
      },
      {
        "year": "2022",
        "month": "July",
        "event": "Started accepting contracts for securities system development."
      },
      {
        "year": "2023",
        "month": "March",
        "event": "Started accepting contracts for Web3 social media application development."
      },
      {
        "year": "",
        "month": "June",
        "event": "Increased capital to 30 million yen."
      },
      {
        "year": "",
        "month": "October",
        "event": "Moved headquarters to Chuo-ku, Tokyo."
      },
      {
        "year": "2024",
        "month": "May",
        "event": "Increased capital to 55 million yen."
      }
    ]
  },

  "consult": {
    "contactForm": "Contact Form",
    "home": "Home",
    "name": "Name",
    "firstName": "First",
    "lastName": "Last",
    "companyName": "Company Name",
    "departmentName": "Department Name",
    "jobName": "Job Title",
    "email": "Email",
    "phone": "Phone",
    "message": "Query content",
    "required": "Required",
    "phoneNote": "※Please provide a phone number that is easy to reach during the day.",
    "submit": "Submit",
    "privacyPolicy": "Privacy Policy",
    "policyInfo": "xFuture Inc. (hereinafter referred to as 'the Company') has established the following personal information protection policy and implemented a system to protect personal information. Through thorough awareness and efforts by all employees regarding the importance of personal information protection, we promote the protection of personal information.",
    "managementTitle": "Management of Personal Information",
    "managementContent": "The Company ensures that customer personal information is accurate and up to date, and takes necessary measures to prevent unauthorized access, loss, damage, alteration, and leakage of personal information. We maintain security systems, improve management frameworks, provide employee training, and implement strict security measures to ensure the protection of personal information.",
    "messages": {
      "submitSuccess": "Submission Successful",
      "firstName": "First name is required",
      "lastName": "Last name is required",
      "companyName": "Company name is required",
      "jobName": "Job title is required",
      "email": "Email is required",
      "phone": "Phone number is required",
      "message": "Query content"
    },
    "input": {
      "firstName": "Yamada",
      "lastName": "Taro",
      "companyName": "ABC Corporation",
      "departmentName": "Sales Department",
      "jobName": "Manager",
      "message": "Please write what you want to say."
    },
    "checkLabel": "Agree to Privacy Policy",
    "buttonSubmit": "Submit",
    "buttonSubmitting": "Sending...",
    "agree1": "After reading the content of the privacy policy thoroughly, if you understand the content,",
    "agree2": "please select 「Agree」and press the 「Send」 button."
  },

  "adopt": {
    "title": "Recruitment",
    "home": "Home",
    "introduction1": "We are looking for partners to create future IT together",
    "introduction2": "We are looking for passionate partners to pursue technological innovation and service evolution, and respond to market changes. Together, we can provide cutting-edge solutions and create the future of IT.",
    "numbers": "xFuture by the numbers",
    "numbers_t1": "Paid leave utilization rate",
    "numbers_t2": "Mid-career hiring / Graduate hiring",
    "numbers_t3": "Languages spoken ratio",
    "numbers_t4": "Average annual salary",
    "numbers_t5": "Full-time employee ratio",
    "numbers_unit": "5.71 M",
    "welfare": "Benefits",
    "welfare_t1": "Remote work system",
    "welfare_t2": "Lifestyle support (transportation expenses, etc.)",
    "welfare_t3": "Training and education system",
    "welfare_t4": "Certification support",
    "welfare_t5": "Health insurance and pension plan",
    "welfare_t6": "Regular health checkups",
    "welfare_t7": "Internal events",
    "welfare_t8": "Employee trips",
    "welfare_c1": "A system that allows working from home when necessary",
    "welfare_c2": "Full reimbursement of commuting expenses",
    "welfare_c3": "Various training and seminars to support improvement of technical and management skills",
    "welfare_c4": "Subsidy for certification costs, supporting career advancement",
    "welfare_c5": "Full coverage of medical and pension support",
    "welfare_c6": "Annual health checkup to support health management",
    "welfare_c7": "Regular team-building events and social gatherings to promote interaction among employees",
    "welfare_c8": "Annual employee trips to refresh and deepen team bonding",
    "description": "Job Description",
    "description_introduction1": "Connecting the world, connecting the future",
    "description_introduction2": "We aim to be a bridge that connects companies with their customers through system development. By aligning with our customers' needs and leveraging optimal technology and innovative ideas, we create steps toward the future together.",
    "description_content1": "Through SES, we respond to diverse technical needs of our clients by dispatching engineers with expertise and skills. This enables project efficiency, problem resolution, and resource optimization. Our engineers are keenly aware of the latest technological trends and market dynamics, delivering optimal solutions to support our clients' business success.",
    "description_content2": "Based on client requirements, we provide a consistent service from design to development, testing, and deployment, delivering comprehensive solutions for project success. Our engineering team, with extensive experience and high technical skills, builds innovative systems incorporating the latest technology trends to support business growth. Additionally, we emphasize close communication with clients and flexibly adapt to changing requirements and market dynamics to achieve optimal results.",
    "description_title": "System outsourcing and contract development",
    "service": "Go to Service Page",
    "sign": "xFuture Seeks These Traits",
    "sign_element1": "Problem-solving ability",
    "sign_element2": "Communication ability",
    "sign_element3": "Innovation mindset",
    "sign_element4": "Proactive",
    "sign_element5": "Self-learning ability",
    "sign_element_d1": "Ability to find creative solutions to complex technical problems",
    "sign_element_d2": "Ability to explain technical content clearly and communicate effectively with teams and clients",
    "sign_element_d3": "Constantly pursue new technologies and innovations, thinking beyond existing frameworks",
    "sign_element_d4": "Proactively identify issues and take action to resolve them",
    "sign_element_d5": "Willingness to continuously learn new technologies and market trends",
    "requirements": "Job Requirements",
    "container_option1": "General Position (Sales)",
    "container_option2": "General Position (System Engineer)",
    "container_option3": "Administrative Staff",
    "container_option4": "Project Manager",
    "requirements_A": "New Graduate",
    "requirements_B": "Mid-career",
    "requirements_B_text": "As a system engineer, participate in system development projects for corporate clients, handling system proposals, requirements organization, and project promotion. As a development group leader, propose projects and be involved in system development for corporate clients.",
    "table_B_title1": "Qualifications",
    "table_B_title2": "Employment Type",
    "table_B_title3": "Expected Annual Salary",
    "table_B_title4": "Location",
    "table_B_text1": {
      "qualification": "■ Required experience, skills, and knowledge",
      "required": "【Essential Requirements】",
      "required_content": [
        "· About 5 years of experience in business system development",
        "· Experience leading a team of 5 or more",
        "· Japanese Language Proficiency Test N1 (for foreign nationals only)"
      ],
      "condition": "【Preferred Requirements】",
      "condition_content": [
        "Desired experience, skills, and knowledge",
        "· Project manager experience",
        "· Language skills",
        "→ Chinese (Business level)",
        "→ English (Business level)"
      ]
    },
    "table_B_text2": "Full-time Employee",
    "table_B_text3": {
      "wages": "6 million - 15 million yen",
      "tips": "※Details will be provided during the interview"
    },
    "table_B_text4": "Headquarters (Nihonbashi), Tokyo 23 wards",
    "table_A_title1": "Qualifications",
    "table_A_title2": "Contract Term",
    "table_A_title3": "Probation Period",
    "table_A_title4": "Location",
    "table_A_title5": "Working Hours",
    "table_A_title6": "Initial Salary",
    "table_A_title7": "Benefits",
    "table_A_title8": "Allowances",
    "table_A_title9": "Transportation",
    "table_A_title10": "Salary Increase",
    "table_A_title11": "Bonus",
    "table_A_text1": {
      "describe": "Graduates or expected graduates from higher vocational schools or four-year universities, master's, or doctoral courses between April 2024 and March 2025",
      "point": [
        "※Japanese Language Proficiency Test N1 (for foreign nationals only)",
        "※No specific field or major required",
        "※Graduates who have already finished their studies are also eligible"
      ]
    },
    "table_A_text2": "No fixed term",
    "table_A_text3": "Probation period (typically 3 months)",
    "table_A_text4": "Headquarters (Nihonbashi), client locations within Tokyo",
    "table_A_text5": {
      "time": [
        "9:30 - 18:30 (1-hour break)",
        "Flexible working hours from 7:00 - 10:00 and 15:00 - 22:00",
        "Core hours are 10:00 - 12:00, 13:00 - 15:00"
      ],
      "instructions": "Other discretionary work system (assumed working hours of 7.5 hours)",
      "point": [
        "※The standard working hours are 8 hours, with start and end times varying depending on workplace or business",
        "※Overtime or weekend work may occur depending on work requirements"
      ]
    },
    "table_A_text6": {
      "instructions": "2024 April initial salary",
      "point": [
        "Doctorate: 270,000 yen",
        "Master's: 250,000 yen",
        "Bachelor's: 230,000 yen",
        "Specialized: 210,000 yen",
        "Higher vocational: 200,000 yen"
      ]
    },
    "table_A_text7": "Financial savings, employee stock ownership, homeownership support, home loan repayment assistance, childcare and nursing support, health checkups, corporate pensions, etc.",
    "table_A_text8": "Childcare/Nursing Allowance",
    "table_A_text9": "Reimbursement",
    "table_A_text10": "July",
    "table_A_text11": "Twice a year (June, December)"
  },
  "news": {
    "title": "News / Blog",
    "title2": "News / Blog List",
    "title3": "News Title",
    "home": "Home",
    "option1": "News",
    "option2": "Blog",
    "goback": "Back to News List Page",
    "noContent": "No notice / blog"
  },
  "top": {
    "rotate_t1": "Beyond a Comfortable Future",
    "rotate_t2": "We solve challenges with advanced tech and flexible solutions, creating a future beyond comfort.",
    "intr_wwa1": "What is xFuture",
    "intr_wwa2": "We are an IT company that continues to provide solutions that respond to market changes through the exploration of innovative technologies and services.",
    "intr_wwa3": "We are an IT company that continues to provide solutions that respond to market changes through the exploration of innovative technologies and services. We encourage continuous learning and progress of our employees, building a dynamic team that is sensitive to the latest technologies and market trends, and professionally and technically excellent. We also have comprehensive training and career development programs to nurture industry-leading engineers and technical experts.",
    "intr_service_button": "Go to Service Page",
    "contact_text1": "Contact Us",
    "contact_text2": "Business Hours",
    "message": "Click here for the contact form",
    "recruit_text1": "Join us to create a comfortable future",
    "recruit_text2": "Recruitment Information",
    "introduce_text1": "Company Overview",
    "introduce_text2": "An IT company that provides solutions to respond to market changes through innovative technologies and services, and supports client business growth through system contracting, outsourced development, and SES operations.",
    "introduce_text3": "Go to Company Overview",
    "news_text1": "News / Blog",
    "news_text2": "News",
    "news_text3": "Blog",
    "news_text4": "Go to News / Blog List",
    "service_text1": "Through SES, we respond to the diverse technical needs of clients by dispatching engineers with specialized knowledge and skills. This helps in streamlining projects, solving technical challenges, and optimizing resources. Our engineers are sensitive to the latest technological trends and market movements, providing the best solutions to support the business success of our clients.",
    "service_text2": "System Contracting and Outsourced Development",
    "service_text3": "Based on client requirements, we provide end-to-end services from design, development, testing, to implementation, delivering comprehensive solutions to ensure the success of projects. Our team of engineers with rich experience and high technical skills builds innovative systems that incorporate the latest technology trends to support business growth. Additionally, we emphasize close communication with clients, flexibly responding to changing requirements and market trends to achieve optimal results.",
    "st": "service"
  }
}
